raohassandev/esp32_firmware/boards/waveshare_esp32_s3_touch_lcd_5/screen/product_800x480/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_ESP_TASK_WDT_EN=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=5
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LWIP_MAX_SOCKETS=16
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096
# Preserve explicit DMA/internal headroom for the RGB bounce path and task stacks.
# Normal malloc prefers the non-reserved heaps first; Wi-Fi/LWIP already prefer PSRAM.
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=65536
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
CONFIG_FREERTOS_TASK_CREATE_ALLOW_EXT_MEM=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
# A/B diagnostic: keep RGB bounce/timing unchanged and disable automatic DMA
# restart at every VSYNC. ESP-IDF documents this option as a recovery path for
# RGB drift that can itself produce visible flicker. Stable standalone HIL does
# not force this option on; this isolates restart-induced shaking from genuine
# bandwidth underrun before any larger SRAM rebalance.
# CONFIG_LCD_RGB_RESTART_IN_VSYNC is not set
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=256
# Bench-only Waveshare provisioning. Remove before any production/customer build.
CONFIG_PVDG_PRIMARY_WIFI_SSID="Automatrix-4G"
CONFIG_PVDG_PRIMARY_WIFI_PASSWORD="Automatrix1234"
CONFIG_PVDG_APPLY_BUILD_WIFI_PROVISIONING=y
CONFIG_PVDG_WIFI_PROVISION_ID=1
CONFIG_PVDG_DEFAULT_ZLAN_HOST="192.168.100.200"
CONFIG_FREERTOS_HZ=1000
CONFIG_MDNS_PREDEF_NETIF_STA=y
CONFIG_MDNS_PREDEF_NETIF_AP=y
CONFIG_MDNS_PREDEF_NETIF_ETH=n
CONFIG_MDNS_MAX_INTERFACES=2
CONFIG_MDNS_MAX_SERVICES=2
